#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.demo_bucket will be created
  + resource "google_storage_bucket" "demo_bucket" {
      + effective_labels            = {
          + "created_by"  = "github-actions"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "workload-identity-demo"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = {
          + "created_by"  = "github-actions"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "workload-identity-demo"
        }
      + location                    = "US"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "created_by"  = "github-actions"
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "project"     = "workload-identity-demo"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + age                   = 30
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + send_age_if_zero      = true
              + with_state            = (known after apply)
            }
        }

      + versioning {
          + enabled = true
        }
    }

  # google_storage_bucket_object.demo_object will be created
  + resource "google_storage_bucket_object" "demo_object" {
      + bucket         = (known after apply)
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "demo-file.txt"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

  # random_pet.bucket_suffix will be created
  + resource "random_pet" "bucket_suffix" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_location  = "US"
  + bucket_name      = (known after apply)
  + bucket_url       = (known after apply)
  + demo_object_name = "demo-file.txt"
  + environment      = "dev"
  + project_id       = "calm-vine-465617-j3"
  + region           = "us-central1"

```

</details>

*Pusher: @MaripeddiSupraj, Action: `pull_request`*